test/validationBouncingParticle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(

    hex (0 1 2 3 4 5 6 7) (5 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (  
		    (0 1 2 3)
		    (4 5 6 7)
		    (0 1 5 4)
		    (3 2 6 7)
        );
    }
    inlet
    {
    	type patch;
    	faces
    	(
    		(0 3 7 4)
    	);
    }
    outlet
    {
    	type patch;
    	faces
    	(
    		(1 2 6 5)
    	);
    }
);

// ************************************************************************* //
